content/roam/20211210171817-veos_fto.org
:PROPERTIES:
:ID:       b104e2bd-7fa1-427c-989b-4d758e90123d
:END:
#+title: veos-FTO

* CN105752084B 一种新能源汽车能量优化方法 权1
** 相似的部分是观测量（车速，加速度，油门踏板等），但是汽车基本上也就是这些观测量
** 调节量不同：此专利的调节量是混动车控制器中功率分配比例； 我司专利的调节量是车辆控制器的各类标定表（比如油门踏板请求力矩映射表）
** 应用领域不同：
*** 混动车（电机+发动机），分配功率
** 方法上不一样
*** 基于驾驶员意图特征识别，基于传统特征工程不可行
**** 此专利中叙述测量状态（车速，加速度，档位和油门）和意图（起步，加速，超车）根本不同，有巨大的差异
*** 决策基于特征工程（电机，发动机效率图），不可行
**** 基于粗略的理论模型，和节能的最终目标之间存在巨大的差异
**** 基于不精确的理论系统模型，忽略模型偏差，噪声

* CN109927709B 一种车辆行驶路线工况确定方法，能量管理方法及系统，权6
** 方法不一样，此专利是传统特征工程，基于工况识别，不可行
*** 此专利对工况的定义是基于粗糙的特征值和离散的分类；而实际工况是连续的；我司专利处理的是连续的实际工况，不直接分类
*** 不考虑噪声的基于特征量工况识别也不可能精确
*** 根据特定工况下冻结所谓最优控制参数，肯定不是最优的； 在随机控制里叫开环控制，我司专利的控制方案是随机闭环控制， 实时根据观测量调整控制量才有可能在真实环境（非平稳，有噪声）取得最优；根据不精确的工况识别做出离散工况分类，不存在最优控制参数
*** 主观工况分类造成模型假设偏差，也不可能达到最优
* CN111319626B 车辆控制参数的调整方法、装置、电子设备及存储介质，权1
** 此权力要求似乎非常宽泛：“通过用户的操作和操作产生车辆状态变化选择车辆控制参数”。几乎可以包含所有的对车辆控制方案， 应该也可以包含前面两个专利的主要权力要求。
** 和我司专利的差异和前两个专利类似，此专利主要也是基于一张查找表，其实对应的方法也是对工况的离散分类，开环控制，没有可实现性。
