20211210171817-veos_fto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>veos-FTO</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">veos-FTO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeee5ed7">CN105752084B 一种新能源汽车能量优化方法 权1</a>
<ul>
<li><a href="#orgbe625bd">相似的部分是观测量（车速，加速度，油门踏板等），但是汽车基本上也就是这些观测量</a></li>
<li><a href="#org00c525e">调节量不同：此专利的调节量是混动车控制器中功率分配比例； 我司专利的调节量是车辆控制器的各类标定表（比如油门踏板请求力矩映射表）</a></li>
<li><a href="#org96acc14">应用领域不同：</a>
<ul>
<li><a href="#org366824c">混动车（电机+发动机），分配功率</a></li>
</ul>
</li>
<li><a href="#org3568e3b">方法上不一样</a>
<ul>
<li><a href="#org1154e0b">基于驾驶员意图特征识别，基于传统特征工程不可行</a></li>
<li><a href="#org46da847">决策基于特征工程（电机，发动机效率图），不可行</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3e719c3">CN109927709B 一种车辆行驶路线工况确定方法，能量管理方法及系统，权6</a>
<ul>
<li><a href="#org6f3215d">方法不一样，此专利是传统特征工程，基于工况识别，不可行</a>
<ul>
<li><a href="#orgf56df8c">此专利对工况的定义是基于粗糙的特征值和离散的分类；而实际工况是连续的；我司专利处理的是连续的实际工况，不直接分类</a></li>
<li><a href="#org13fed56">不考虑噪声的基于特征量工况识别也不可能精确</a></li>
<li><a href="#orge26fd2b">根据特定工况下冻结所谓最优控制参数，肯定不是最优的； 在随机控制里叫开环控制，我司专利的控制方案是随机闭环控制， 实时根据观测量调整控制量才有可能在真实环境（非平稳，有噪声）取得最优；根据不精确的工况识别做出离散工况分类，不存在最优控制参数</a></li>
<li><a href="#org9b3c5a6">主观工况分类造成模型假设偏差，也不可能达到最优</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2d7c794">CN111319626B 车辆控制参数的调整方法、装置、电子设备及存储介质，权1</a>
<ul>
<li><a href="#org573d2c9">此权力要求似乎非常宽泛：“通过用户的操作和操作产生车辆状态变化选择车辆控制参数”。几乎可以包含所有的对车辆控制方案， 应该也可以包含前面两个专利的主要权力要求。</a></li>
<li><a href="#org4f52214">和我司专利的差异和前两个专利类似，此专利主要也是基于一张查找表，其实对应的方法也是对工况的离散分类，开环控制，没有可实现性。</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       b104e2bd-7fa1-427c-989b-4d758e90123d
</p>

<div id="outline-container-orgeee5ed7" class="outline-2">
<h2 id="orgeee5ed7">CN105752084B 一种新能源汽车能量优化方法 权1</h2>
<div class="outline-text-2" id="text-orgeee5ed7">
</div>
<div id="outline-container-orgbe625bd" class="outline-3">
<h3 id="orgbe625bd">相似的部分是观测量（车速，加速度，油门踏板等），但是汽车基本上也就是这些观测量</h3>
</div>
<div id="outline-container-org00c525e" class="outline-3">
<h3 id="org00c525e">调节量不同：此专利的调节量是混动车控制器中功率分配比例； 我司专利的调节量是车辆控制器的各类标定表（比如油门踏板请求力矩映射表）</h3>
</div>
<div id="outline-container-org96acc14" class="outline-3">
<h3 id="org96acc14">应用领域不同：</h3>
<div class="outline-text-3" id="text-org96acc14">
</div>
<div id="outline-container-org366824c" class="outline-4">
<h4 id="org366824c">混动车（电机+发动机），分配功率</h4>
</div>
</div>
<div id="outline-container-org3568e3b" class="outline-3">
<h3 id="org3568e3b">方法上不一样</h3>
<div class="outline-text-3" id="text-org3568e3b">
</div>
<div id="outline-container-org1154e0b" class="outline-4">
<h4 id="org1154e0b">基于驾驶员意图特征识别，基于传统特征工程不可行</h4>
<div class="outline-text-4" id="text-org1154e0b">
</div>
<ul class="org-ul">
<li><a id="org5e77664"></a>此专利中叙述测量状态（车速，加速度，档位和油门）和意图（起步，加速，超车）根本不同，有巨大的差异<br /></li>
</ul>
</div>
<div id="outline-container-org46da847" class="outline-4">
<h4 id="org46da847">决策基于特征工程（电机，发动机效率图），不可行</h4>
<div class="outline-text-4" id="text-org46da847">
</div>
<ul class="org-ul">
<li><a id="org2472e48"></a>基于粗略的理论模型，和节能的最终目标之间存在巨大的差异<br /></li>
<li><a id="orgc2fa78a"></a>基于不精确的理论系统模型，忽略模型偏差，噪声<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3e719c3" class="outline-2">
<h2 id="org3e719c3">CN109927709B 一种车辆行驶路线工况确定方法，能量管理方法及系统，权6</h2>
<div class="outline-text-2" id="text-org3e719c3">
</div>
<div id="outline-container-org6f3215d" class="outline-3">
<h3 id="org6f3215d">方法不一样，此专利是传统特征工程，基于工况识别，不可行</h3>
<div class="outline-text-3" id="text-org6f3215d">
</div>
<div id="outline-container-orgf56df8c" class="outline-4">
<h4 id="orgf56df8c">此专利对工况的定义是基于粗糙的特征值和离散的分类；而实际工况是连续的；我司专利处理的是连续的实际工况，不直接分类</h4>
</div>
<div id="outline-container-org13fed56" class="outline-4">
<h4 id="org13fed56">不考虑噪声的基于特征量工况识别也不可能精确</h4>
</div>
<div id="outline-container-orge26fd2b" class="outline-4">
<h4 id="orge26fd2b">根据特定工况下冻结所谓最优控制参数，肯定不是最优的； 在随机控制里叫开环控制，我司专利的控制方案是随机闭环控制， 实时根据观测量调整控制量才有可能在真实环境（非平稳，有噪声）取得最优；根据不精确的工况识别做出离散工况分类，不存在最优控制参数</h4>
</div>
<div id="outline-container-org9b3c5a6" class="outline-4">
<h4 id="org9b3c5a6">主观工况分类造成模型假设偏差，也不可能达到最优</h4>
</div>
</div>
</div>
<div id="outline-container-org2d7c794" class="outline-2">
<h2 id="org2d7c794">CN111319626B 车辆控制参数的调整方法、装置、电子设备及存储介质，权1</h2>
<div class="outline-text-2" id="text-org2d7c794">
</div>
<div id="outline-container-org573d2c9" class="outline-3">
<h3 id="org573d2c9">此权力要求似乎非常宽泛：“通过用户的操作和操作产生车辆状态变化选择车辆控制参数”。几乎可以包含所有的对车辆控制方案， 应该也可以包含前面两个专利的主要权力要求。</h3>
</div>
<div id="outline-container-org4f52214" class="outline-3">
<h3 id="org4f52214">和我司专利的差异和前两个专利类似，此专利主要也是基于一张查找表，其实对应的方法也是对工况的离散分类，开环控制，没有可实现性。</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
